Revit 2027 API
NumberingFormattedParameter(NumberingFormattedParameter) Constructor
 Copy the NumberingFormattedParameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumberingFormattedParameter(
	NumberingFormattedParameter other
)
Public Sub New (
	other As NumberingFormattedParameter
)
public:
NumberingFormattedParameter(
	NumberingFormattedParameter^ other
)
new :
        other : NumberingFormattedParameter -> NumberingFormattedParameter
Parameters
other NumberingFormattedParameter
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingFormattedParameter Class
NumberingFormattedParameter Overload
Autodesk.Revit.DB Namespace